import React from 'react'
import "./ExpensesDate.css"

export const ExpenseDate = ({date}) => {



  //   экспенсес айтемден  датаны ппропс аркылуу алат . ал озу  обьект анын ичинен бизге   кун ай анан жыл керек 
  
    const day=date.toLocaleString("en-US", {day: 'numeric' })
    //  кунду алуу учун аны атайын бин кун деген переменныйга сактап жана пропс аркылуу келген дейтти  алып анын ичинен биздин локация аркылуу алыпган кундун   англисте фармат менен  номер мене чыкты
       const month=date.toLocaleString("en-US", {month: 'long' })
         //  айды алуу учун аны атайын биз ай деген переменныйга сактап жана пропс аркылуу келген дейтти  алып анын ичинен биздин локация аркылуу алыпган айды   англисте фармат менен   айдын узун аталышын чыгардык
    const year=date.toLocaleString("en-US", {year: 'numeric' })
      //  жылды алуу учун аны атайын биз жыл деген переменныйга сактап жана пропс аркылуу келген дейтти  алып анын ичинен биздин локация аркылуу алыпган жылдын   англисте фармат менен  номер менен чыгардык
        return (
    <div  className='expense-date'>

       {/*  бир роот элементтин ичинде жогоруда пропс аркылуу келген дейт деген обьектини чачыратып ар бирин  оз озунч кылып алдык эми ошол алынган датаны ар бирин бирден элементке салдык */}
        <div className='expense-date__day'>{day}</div>
        <div className='expense-date__month'>{month}</div>
        <div className='expense-date__year '>{year}</div>
    </div>
  )
}
